WSC_I85S78/CFD/0/Ksl
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ksl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
600
(
3.30962e+08
2.0986e+08
1.04015e+08
5.24529e+07
5.28092e+07
6.19612e+07
5.1151e+07
4.29932e+07
...
)
;

boundaryField
{
    wall_bottom
    {
        type            zeroGradient;
    }
    wall_top
    {
        type            zeroGradient;
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
    front3
    {
        type            cyclic;
    }
    back3
    {
        type            cyclic;
    }
    left3
    {
        type            cyclic;
    }
    right3
    {
        type            cyclic;
    }
}


// ************************************************************************* //
